{
    "categories": {
        "0": "containers",
        "1": "blog",
        "2": "productivity",
        "3": "media",
        "4": "social network"
    },
    "demo_page": "https://data-visualization-plotly.bubbleapps.io/version-test/quill-rich-text-editor",
    "description": "Quill Rich Text Editor plugin for bubble.io is a plugin that allows your application's users to create and edit rich text content directly on the application. \n\nQuill is a WYSIWYG editor built for the modern web. \n\nThe plugin has a modern look and dynamic toolbar options that make the input highly customizable. \n\nThe plugin also supports actions and events such as setting focus, resetting input, and triggering workflows when the text value changes. \n\nQuill Rich Text Editor plugin for bubble.io is a powerful and flexible tool for creating rich text content on your no code applications.",
    "image": "//s3.amazonaws.com/appforest_uf/f1678616009845x554431892714320830/Quilljs.png",
    "license": "open_source",
    "name": "Quill Rich Text Editor",
    "plugin_instructions": "# Quill Rich Text Editor\n\nA Plugin for [Bubble.i](http://bubble.io/)[o](http://bubbl.io/) Powered by Quill JS\n\n## What is Quill JS?\n\nQuill JS is a powerful, open-source text editor that is designed for modern web applications. It offers a clean and distraction-free interface that helps users focus on their writing, and it includes a variety of formatting options, including headings, bold and italic text, numbered and bulleted lists, and block quotes.\n\n## Features of the Quill RTE Plugin\n\nThe Quill Rich Text Editor plugin brings the power of Quill's text editor to the platform, enabling your users create high level contents.\n\nHere are some of the features of the plugin:\n\n## Actions\n\nYou can do anything through the workflows:\n\n- Delete Text: Deletes part of text within the editor.\n- Set Text: Sets the text of the editor's contents.\n- Insert Text: Add texts to specific point of the editor.\n- Set Contents: Sets the contents of the editor.\n- Update Contents: Updates the contents of the editor with Delta (Quill Formatting)\n- Insert Embed: Inserts embedded content (such as images or videos) into the editor.\n- Blur: Removes focus from the editor.\n- Focus: Sets focus on the editor.\n- Enable: Enables/Disable the editor.\n- Update: Updates the editor's contents.\n\n## States\n\nGet current user selection content or entire editor’s content when you need:\n\n- Contents: Returns the contents of the editor with Quill formatting.\n- Length: Returns the length of the editor's contents.\n- Text: Returns the simple text of the editor's contents.\n- Format: Returns the format of the editor's selection.\n- Selection: Returns the user current selection.\n\n## Triggers\n\nTrigger actions according to user activity:\n\n- text-change: Triggered when the editor's contents change.\n- selection-change: Triggered when the editor's selection changes.",
    "sa_node_version": 14
}